In [21]:
import math
import statistics
import numpy as np
import pandas as pd 
belize_df = pd.read_csv('belize_airbnb_listings.csv')
grouped_belize = belize_df.groupby('neighbourhood_group').agg({
    'price': 'mean',
    'number_of_reviews': 'sum',
    'availability_365': 'max'
}).reset_index()

pd.DataFrame(grouped_belize)

  neighbourhood_group       price  number_of_reviews  availability_365
0              Belize  380.302414              27100               365
1                Cayo  205.847525               7356               365
2             Corozal  156.553846                492               365
3         Orange Walk  122.035714                415               365
4         Stann Creek  471.119584               4855               365
5              Toledo  222.978723                194               365